In [59]:
import numpy as np
import pandas as pd

In [60]:
data = [['tom', 0,1, 1, 0, 1, 0], ['nick', 1,0, 1, 0, 0, 1], ['juli', 1,0, 1, 0, 0, 1]]

In [61]:
df = pd.DataFrame(data, columns = ['Name', 'Pass', 'Fail', 'Male', 'Female', 'Above 18', 'Below 18'])

In [63]:
df
# df.dtypes

# df["Male"]

   Name  Pass  Fail  Male  Female  Above 18  Below 18
0   tom     0     1     1       0         1         0
1  nick     1     0     1       0         0         1
2  juli     1     0     1       0         0         1

In [64]:
def MaleOrFemale(x):
    if x['Male'] == 1:
        return 'M'
    else:
        return 'F'
        
df['Sex'] = df.apply(lambda x: MaleOrFemale(x),axis=1)

1
1
1

In [66]:
def results(x):
    if x['Pass'] == 1:
        return 'Pass'
    else:
        return 'Fail'
        
df['Result'] = df.apply(lambda x: results(x),axis=1)

In [67]:
df

   Name  Pass  Fail  Male  Female  Above 18  Below 18 Sex Result
0   tom     0     1     1       0         1         0   M   Fail
1  nick     1     0     1       0         0         1   M   Pass
2  juli     1     0     1       0         0         1   M   Pass